www/app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY starts_at
---
  def index
    @events = Event.all :order => 'starts_at'

INSERT INTO "events" ("ends_at", "updated_at", "starts_at", "created_at", "location", "description", "homepage", "name") VALUES ('2011-03-13 19:16:00.000000', '2011-02-19 19:18:39.277203', '2011-03-12 19:16:00.000000', '2011-02-19 19:18:39.277203', 'University of Waterloo''s Student Life Centre', '>Our 19th annual festival is March 12th and 13th this year. We are in Waterloo, Ontario, Canada.
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
UPDATE "events" SET "updated_at" = '2011-02-19 20:13:17.490288', "description" = '>Our 19th annual festival is March 12th and 13th this year. We are in Waterloo, Ontario, Canada.
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])