www/app/controllers/executives_controller.rb

SELECT "executives".* FROM "executives" WHERE "executives"."is_active" = 't' LIMIT 1
---
	def index
    @executives = Executive.where('is_active' => true)

SELECT "executives".* FROM "executives" WHERE "executives"."id" = 1 LIMIT 1
---
	def show
    @executive = Executive.find(params[:id])

SELECT "executives".* FROM "executives" WHERE "executives"."id" = 1 LIMIT 1
---
	def edit
    @executive = Executive.find(params[:id])

SELECT "executives".* FROM "executives" WHERE "executives"."id" = 1 LIMIT 1
UPDATE "executives" SET "photo_content_type" = 'image/jpeg', "photo_file_size" = 86591, "photo_updated_at" = '2011-02-19 20:37:08.356166', "updated_at" = '2011-02-19 20:37:08.845235', "photo_file_name" = 'photo1.jpg' WHERE "executives"."id" = 1
---
  def update
    @executive = Executive.find(params[:id])

		if @executive.update_attributes(params[:executive])

INSERT INTO "executives" ("is_active", "photo_updated_at", "photo_content_type", "about", "position", "created_at", "name", "photo_file_name", "contact", "updated_at", "photo_file_size") VALUES ('t', '2011-02-19 20:45:27.231254', 'image/jpeg', 'Sean has been juggling with the club for 15 years. He will happily show you some diabolo or cigar box tricks, if you are interested.', 'Alumni Advisor', '2011-02-19 20:45:27.291700', 'Sean Haddow', 'sean.jpg', '', '2011-02-19 20:45:27.291700', 11146) RETURNING "id"
---
  def create
    @executive = Executive.new params[:executive]

    if @executive.save